[{"id":1, "title": "Real Estate Agency", "description":"A Real Estate agency that allows registered users to view info about the property and follow it, and agents to do all things mentioned previously plus managing the properties, such as adding, editing and delisting them when sold. Unregistred users are only able to see little info about the properties. Its also possible to search properties by price or location", "images":["realEstate1","realEstate2","realEstate3","realEstate4","realEstate5"],"tech":["Angular","NodeJS","ExpressJS","MongoDB","REST API","JSON Web Token", "Bootstrap"], "github":"https://github.com/franciscovieiracode/RealEstateAgency"},
{"id":2, "title":"Online Banking", "description":"A BPI clone, a online Banking system that allow registered users to make transfers, payments throught Entity/Reference and also cellphones. Your also allowed to see profile details and transactions history (IMCOMPLETE PROJECT)","images":["banking1","banking2"], "tech":["Angular","Spring Boot","Spring Security","JPA","Hibernate","PostgreSQL","REST API","JSON Web Token","Bootstrap"],"github":"https://github.com/franciscovieiracode/Online-Banking"},
{"id":3, "title":"Crypto Prices", "description":"Updated prices and more of top 30 cryptocurrencies by marketcap, data retrived from Binance public API and its being refreshed every 5 seconds","images":["crypto1","crypto2","crypto3"], "tech":["Angular","REST API","Bootstrap"],"github":"https://github.com/franciscovieiracode/Crypto_Prices"},
{"id":4, "title":"Timer Countdown", "description":"A basic coutdown that i used myself during my study time, its automatically set for 1 hour straight, your able to pause and also reset it. When the timer is done, a message will be shown ","images":["timer1","timer2","timer3"], "tech":["Javascript","Html","Bootstrap"],"github":"https://github.com/franciscovieiracode/BasicCoutdown"},
{"id":5, "title":"Sensors management", "description":"A project made for Object Oriented Programming Course, was developed a API that is possible to add cities and then add stations to those cities, the stations will have a certain number of sensors that will recover all kind of measurements from time to time, its also possible to export statistics to a chart and import data via Json","images":null, "tech":["Java","Json","Google Charts"],"github":"https://github.com/franciscovieiracode/PP_2021_TP"},
{"id":5, "title":"Delivery Company", "description":"A project made for Software Engineering II Course, was developed a Software for a deliverie company using a API that was developed in part 1 of the course, project is also on github. Has to be created the sender and receiver of the order as long as the products in the order. Its also calculated the cost of the delivery based on distance and we can get detailed Json Statistics","images":null, "tech":["Java","Json"],"github":"https://github.com/franciscovieiracode/Es2_TP_2022"}]